RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
#include <Arduino.h>

// Program 'Esp32_Viessm_Analog_Meter' Branch Master
#define PROGRAMVERSION "v1.0.0"
// Last updated: 2025_03_08
// Copyright: RoSchmi 2024 License: Apache 2.0
// the App was tested only on ESP32 Dev Board, no attempts were made to run it 
// on variations of ESP32 or ESP8266

// Uses
// platform espressif32@6.7.0 and platform_package framework-arduinoespressif32 @ 3.20017.0
// Switched to built-in Filesystem 'LittleFS' instead of 'LITTLEFS'
//
// In cases of a wrong (old) format of the LittleFS flash storage,
// the flash must be cleared with the command (cmd window)
// python C:\Users\<user>\.platformio\packages\tool-esptoolpy\esptool.py erase_flash

// If you still have problems with formatting the flash for LittleFS, try to use
// https://github.com/RoSchmi/ESP32_LittleFS_Simple_Formatter

// Definition of your TimeZone has to be made in config.h
// Original Timezone_Generic library by Khoih-prog is not used
// (didn't take the time to understand) instead I used a modification
// which is part of this App (lib/RoSchmi/RSTimeZone/src)

// The application doesn't compile without a trick:
// The libraries NTPClient_Generic and Timezone_Generic load the
// dependency:
// {
//      "owner": "khoih-prog",
//      "name": "ESP8266_AT_WebServer",
//      "version": ">=1.5.4",
//      "platforms": ["*"]
//    },
// This dependency doesn't compile. So we delete in folder libdeps/ESP32 
// the dependency in the 'library.json' file and delete the entry 
// 'ESP8266_AT_WebServer' in the folder libdeps/ESP32

// This App is based on the software of my App https://github.com/RoSchmi/Esp32_WiFiManager_HeatingSurvey
// this App for Esp32 monitors the activity of the burner of an oil-heating
// (or any other noisy thing) by measuring the sound of e.g. the heating burner
// For details visit the Github Repo of this App 
//
// The Story:
// As I relocated to another city into a house with a Viessmann Vitodens 333F
// heating. For this heating it was easyly possible to mount a VITOCONNECT 100 OPTO1
// module which frequently sends sensor data of the heating via WiFi and internet
// to the Viessmann Cloud and makes it possible to control and monitor the heating 
// via the 'Vicare' App from Viessmann.
// Using this App one can see actual sensor data and change settings, but it is not
// possible to maintain historic sensor data and to display sensor data graphically 
// as a timeline graph.
// As Viessmann provides access to the actual heating sensor data via an API
// I decided to download the sensor data via the API around every minute 
// (1440 downloads per day are free) and store the values of several sensors
// on Azure Storage Tables. This is not free but very cheap (only several cents
// per month) but requires a Microsoft Azure Account.
// So I made this App which loads the sensor data from the Viessmann Cloud
// and stores the data in Azure Storage Tables in a certain way.
// To display these data graphically on an Apple iPhone I use the iPhone App
// 'Charts4Azure' (Android version and a Microsoft Store App with minor functionality
// exist as well). The App 'Charts4Azure' allways displays the combination of
// 4 analog timeline graphs (e.g. 4 temperature sensors) and 4 On/Off timeline graphs 
// (e.g. for burner or pump activity) on one page.

// For this Esp App Router-WiFi Credentials, Azure Credentials and Viessmann Credentials
// can be entered via a Captive Portal page which is provided for one minute
// by the Esp32 after powering up the device. After having entered the credentials
// one time they stay permanently on the Esp32 and need not to be entered every time.

// This App uses an adaption of the 'Async_ConfigOnStartup.ino' as WiFi Mangager
// from: -https://github.com/khoih-prog/ESPAsync_WiFiManager 
// More infos about the functions and Licenses see:
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/blob/master/examples/Async_ConfigOnDoubleReset_Multi
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/tree/master/examples/Async_ConfigOnStartup
 

// The WiFiManager will open a configuration portal in the WLAN Access-Point for 60 seconds when powered up 
// if the boards has stored WiFi Credentials, otherwise, the Access Point will stay indefinitely in ConfigPortal 
// until the Router WiFi Credentials and other Credentials are entered.
// When the Esp32 starts up it provides an Access Point after about one minute to which you must connect
// with your iPhone. The SSID of this Access point is like e.g. ESP32_xxxxxx, if a password is requested 
// (only the first time), the passwort is "My" + the SSID-Name, e.g. MyESP32_xxxxxx.
// Some settings for the Esp32 App have to be made in the files config.h and config_secret.h.
// The special config_secret.h for your system must be provided by copying and renaming
// of config_secret_template.h to config_secret.h

// To access the Viessmann Api through this Esp32 App you to need a Client-Id
// and a 'Refresh Token' which have to be entered in config_secret.h or
// in the Captive Portal Page. The Client-Id and an Access-Token (valid for
// 1 hour can be retrieved from: https://developer.viessmann.com/start/pricing.html
// (Basic -> Get started)
// To get a Refresh-Token you can use my C# Windows Application:
// https://github.com/RoSchmi/RoSchmiViessmannApiTest
// Valueble info can be found here: 
// https://www.rustimation.eu/index.php/a-viessmann-api-und-node-red/

// How to get an Azure Account and there a Storage Account have a
// look here: https://azureiotcharts.home.blog/getting-started-guide/

 
#include <Arduino.h>
#include <vector>
#include <time.h>
#include "ESPAsyncWebServer.h"
#include "defines.h"
#include "config.h"
#include "config_secret.h"
#include "DateTime.h"
#include <freertos/FreeRTOS.h>
#include "Esp.h"
#include "esp_task_wdt.h"
#include "rom/rtc.h"


#include "CloudStorageAccount.h"
#include "TableClient.h"
#include "TableEntityProperty.h"
#include "TableEntity.h"
#include "AnalogTableEntity.h"
#include "OnOffTableEntity.h"

#include "ViessmannApiAccount.h"
#include "ViessmannClient.h"
#include "ViessmannApiSelection.h"

#include "RestApiAccount.h"
#include "AiOnTheEdgeClient.h"
#include "AiOnTheEdgeApiSelection.h"

