RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
    ESP.restart();
    while(true)
    {
      delay(500);
    }
      
  }
}
  
void loop()
{
  check_status();   // Checks if WiFi is still connected
                    // if not, try other Accesspoint
  // put your main code here, to run repeatedly:
  if (++loopCounter % 100000 == 0)   // Make decisions to send data every 100000 th round and toggle Led to signal that App is running
  {

    #if SERIAL_PRINT == 1
      ledState = !ledState;
      digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running
    #endif

    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
    
      // Update RTC from Ntp when ntpUpdateInterval has expired, retry when RetryInterval has expired       
      if (timeClient.update())
      {                                                                      
        dateTimeUTCNow = timeClient.getUTCEpochTime();
        
        timeNtpUpdateCounter++;

        #if SERIAL_PRINT == 1
          // Indicate that NTP time was updated
          char buffer[35] = {0};     
          strcpy(buffer, "NTP-Utc: YYYY-MM-DD hh:mm:ss");           
          dateTimeUTCNow.toString(buffer);
          Serial.println(buffer);
        #endif
      }  // End NTP stuff
          
      dateTimeUTCNow = timeClient.getUTCEpochTime();
      
      // Get offset in minutes between UTC and local time with consideration of DST
      int timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;
      
      localTime = myTimezone.toLocal(dateTimeUTCNow.unixtime());
      timeDiffUtcToLocal = localTime.operator-(dateTimeUTCNow);
      
      // refresh access token if refresh interval has expired 
      if ((AccessTokenRefreshTime.operator+(AccessTokenRefreshInterval)).operator<(dateTimeUTCNow))
      {
          httpCode = refreshAccessTokenFromApi(myX509Certificate, myViessmannApiAccountPtr, viessmannRefreshToken);
          
          if (httpCode == t_http_codes::HTTP_CODE_OK)
          {           
            AccessTokenRefreshTime = dateTimeUTCNow;
          }
          else
          {
            Serial.println(F("Token Refresh failed\n"));            
            AccessTokenRefreshTime = dateTimeUTCNow.operator-(TimeSpan(300));
          }
      }

      // In the last 15 sec of each day we set a pulse to Off-State when we had On-State before
      bool isLast15SecondsOfDay = (localTime.hour() == 23 && localTime.minute() == 59 &&  localTime.second() > 45) ? true : false;

      // Get readings from 4 different analog sensors stored in the Viessmann Cloud    
      // and store the values in a container
       
      dataContainerAnalogViessmann01.SetNewValue(0, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(0, (const char *)"_95_heating_temperature_outside")).value)); // Aussen
      dataContainerAnalogViessmann01.SetNewValue(1, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(1, (const char *)"_3_temperature_main")).value)); // Vorlauf                
      dataContainerAnalogViessmann01.SetNewValue(2, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(2, (const char *)"_90_heating_dhw_cylinder_temperature")).value)); // Boiler
      dataContainerAnalogViessmann01.SetNewValue(3, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(3, (const char *)"_7_burner_modulation")).value));  // Modulation
      
      ledState = !ledState;
      digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running

      // Get readings from 4 different analog sensors, (preferably measured by the Esp 32 device, e.g. noise level)     
      // and store the values in a container
       
      dataContainer.SetNewValueStruct(0, dateTimeUTCNow, ReadAnalogSensorStruct_01(0), true);
      dataContainer.SetNewValueStruct(1, dateTimeUTCNow, ReadAnalogSensorStruct_01(1), true);     
      dataContainer.SetNewValueStruct(2, dateTimeUTCNow, ReadAnalogSensorStruct_01(2), false);      
      dataContainer.SetNewValueStruct(3, dateTimeUTCNow, ReadAnalogSensorStruct_01(3), false); 
      ledState = !ledState;
      digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running

      // Check if automatic OnOffSwitcher has toggled (used to simulate on/off changes)
      // and accordingly change the state of one representation (here index 3) in onOffDataContainer
      // This can be used for debugging, shows that displaying on/off states is
      // working
      /*
      if (onOffSwitcherWio.hasToggled(dateTimeUTCNow))
      {
        bool state = onOffSwitcherWio.GetState();
        onOffDataContainer.SetNewOnOffValue(3, !state, dateTimeUTCNow, timeZoneOffsetUTC);    
      }
      */
      
      // Check if one of the here listed On/Off states has changed     
      // (here: Burner, Circulation Pump, HotWaterCirculation Pump,
      // HotWaterPimary Pump)
   
      if (OnOffBurnerStatus.HasChangedState())
      {    
        onOffDataContainer.SetNewOnOffValue(0, OnOffBurnerStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

      if (OnOffCirculationPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(1, OnOffCirculationPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

      if (OnOffHotWaterCircualtionPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(2, OnOffHotWaterCircualtionPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

      if (OnOffHotWaterPrimaryPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(3, OnOffHotWaterPrimaryPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }
      
      
      // This is for Burner Sound Sensor (need not to be used in this App)    
      /*
      if (feedResult.isValid && (feedResult.hasToggled || feedResult.analogToSend))
      {
          if (feedResult.hasToggled)
          {
            onOffDataContainer.SetNewOnOffValue(0, feedResult.state, dateTimeUTCNow, timeZoneOffsetUTC);
            Serial.print("\r\nHas toggled, new state is: ");
            Serial.println(feedResult.state == true ? "High" : "Low");
            Serial.println();
          }
          // if toogled activate make hasToBeSent flag
          // so that the analog values have to be updated in the cloud
          if (feedResult.analogToSend)
          {
            dataContainer.setHasToBeSentFlag();
            Serial.print("Average is: ");
            Serial.println(feedResult.avValue);             
            Serial.println();
          }           
      }
      */           
      // Check if something is to do: send analog data ? send On/Off-Data ? Handle EndOfDay stuff ?
      if (dataContainerAnalogViessmann01.hasToBeSent() || dataContainer.hasToBeSent() || onOffDataContainer.One_hasToBeBeSent(localTime) || isLast15SecondsOfDay)
      {     
        //Create some buffer
        char sampleTime[25] {0};    // Buffer to hold sampletime        
        char strData[100] {0};          // Buffer to hold display message
        
        char EtagBuffer[50] {0};    // Buffer to hold returned Etag

        // Create az_span to hold partitionkey
        char partKeySpan[25] {0};
        size_t partitionKeyLength = 0;
        az_span partitionKey = AZ_SPAN_FROM_BUFFER(partKeySpan);
        
