RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  if ((pAiOnTheEdgeApiSelectionPtr ->lastReadTime.operator+(pAiOnTheEdgeApiSelectionPtr -> readInterval)).operator<(dateTimeUTCNow))
  {
    char myUriEndpoint[50] = {0}; 
    strncpy(myUriEndpoint, "http://gasmeter/json", sizeof(myUriEndpoint) - 1);
    
    httpCode = readJsonFromRestApi(myX509Certificate, (const char *)myUriEndpoint, sizeof(myUriEndpoint), pAiOnTheEdgeApiSelectionPtr);   
    
    if (httpCode == t_http_codes::HTTP_CODE_OK)
    {
      pAiOnTheEdgeApiSelectionPtr -> lastReadTime = dateTimeUTCNow;  
    }
    else
    {
      pAiOnTheEdgeApiSelectionPtr ->lastReadTime = dateTimeUTCNow;
      Serial.println(F("Failed to read Features from Ai-On-The-Edge-Device")); 
      Serial.println((char*)bufferStorePtr);
    }
  }
   
  if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
  {
    for (int i = 0; i < AI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)ai_features[i].name, pSensorName) == 0)
      {       
        returnFeature = ai_features[i];

        Serial.printf("\nAnalogSensorMgr: Value is used. Index: %d Value: %s\n", pSensorIndex, returnFeature.value);
        
        analogSensorMgr.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);                         
        break;
      }     
    } 
  } 
  return returnFeature;
}

ViessmannApiSelection::Feature ReadViessmannApi_Analog_01(int pSensorIndex, const char* pSensorName)
{
  
  // Use values read from the Viessmann API
  // pSensorIndex determins the position (from 4). pSensorName is the name of the feature (see ViessmannApiSelection.h)
  
  // preset a 'returnFeature' with value = MAGIC_NUMBER_INVALID (999.9)
  ViessmannApiSelection::Feature returnFeature;
  strncpy(returnFeature.value, (floToStr(MAGIC_NUMBER_INVALID)).c_str(), sizeof(returnFeature.value) - 1);
  
  // Only read features from the cloud when readInterval has expired
  
  if ((viessmannApiSelection.lastReadTime.operator+(viessmannApiSelection.readInterval)).operator<(dateTimeUTCNow))
  {
    uint32_t tryCounter = 1;
    httpCode = -1;
    while (tryCounter > 0 && httpCode != t_http_codes::HTTP_CODE_OK)
    {
      httpCode = readViessmannFeaturesFromApi(myX509Certificate, myViessmannApiAccountPtr, Data_0_Id, Gateways_0_Serial, Gateways_0_Devices_0_Id, viessmannApiSelectionPtr);
      if (httpCode == t_http_codes::HTTP_CODE_OK)
      {
        viessmannApiSelection.lastReadTime = dateTimeUTCNow;
        Serial.println(F("Succeeded to read Features from Viessmann Cloud\n"));
      }
      else
      {
        viessmannApiSelection.lastReadTime = dateTimeUTCNow;
        Serial.println(F("Failed to read Features from Viessmann Cloud")); 
        //Serial.println((char*)bufferStorePtr);
      }
      tryCounter--;
    }
  }
  
  if (analogSensorMgr_Api_01.HasToBeRead(pSensorIndex, dateTimeUTCNow))
  {
    //Serial.printf("\nAnalogSensorMgr_Api_01: Value is used %d\n", pSensorIndex); 
      
    for (int i = 0; i < VI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)features[i].name, pSensorName) == 0)
      {
        returnFeature = features[i];
        analogSensorMgr_Api_01.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);           
        break;
      }
    } 
  } 
  return returnFeature;
}

ValueStruct ReadAnalogSensorStruct_01(int pSensorIndex)
{
  ValueStruct returnValueStruct = { 
      .displayValue = (float)MAGIC_NUMBER_INVALID,
      .unClippedValue = (float)MAGIC_NUMBER_INVALID};

  char consumption[12] = {0};

  switch(pSensorIndex)
  {
      case 0:
      { 
        // Total Consumption, DisplayValue and UnClippedValue 
        AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;                      
        // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
        
        AiOnTheEdgeApiSelection::Feature selectedFeature;
        if (isFirstGasmeterRead)
        {
          // Read raw instead of value
          selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"raw", aiOnTheEdgeApiSelectionPtr);
          isFirstGasmeterRead = false;
          char gasMeterUrl[] = "http://gasmeter";
           
          char preValue[12] = {0};
          
          strncpy(preValue, (const char *)selectedFeature.value, sizeof(preValue));
          preValue[sizeof(preValue) -1] = '\0';
          // Write the last raw Value to preValue
          setAiPreValueViaRestApi(myX509Certificate, gasMeterUrl, strlen(gasMeterUrl), (const char *)preValue);
        }
        else
        {
          selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
          
        }

        strncpy(consumption, selectedFeature.value, sizeof(consumption));                                          
     
        float tempNumber = (float)MAGIC_NUMBER_INVALID;
        
        //Serial.printf("writing consumption: %s Length: %d\n", (const char *)consumption, strlen(consumption));
         
        if (isValidFloat(consumption) && strlen(consumption) > strlen("0.00"))
        {
          tempNumber = atof(consumption);
          #if SERIAL_PRINT == 1
            Serial.printf("\nString could be parsed to float: %s StringLength: %d\n", consumption, strlen(consumption));
          #endif
        }
        else
        {
          Serial.printf("Value invalid (0.00) or could not be parsed to float: %s\n", consumption);
          tempNumber = (float)MAGIC_NUMBER_INVALID;
          // RoSchmi
          /*
          while (true)
          {
            delay(500);
          }
          */
        }
        
        // convert values near MAGIC_NUMBER_INVALID to MAGIC_NUMBER_INVALID  
        tempNumber = (tempNumber > (float)MAGIC_NUMBER_INVALID - 0.01 && tempNumber < (float)MAGIC_NUMBER_INVALID + 0.01) ? (float)MAGIC_NUMBER_INVALID: tempNumber;
        
        if (tempNumber > (MAGIC_NUMBER_INVALID - 0.01) && tempNumber < (MAGIC_NUMBER_INVALID + 0.01))
        {
          // if tempNumber = MAGIC_NUMBER_INVALID return both with MAGIC_NUMBER_INVALID
          // was preset at the beginning
          // this means, that the values are ignored in further process
          return returnValueStruct;
        }
        // multply by 10, so that there remains 1 significant digit after decimal point
        sprintf(consumption, "%.1f", tempNumber * 10);
        returnValueStruct.unClippedValue = atof((const char *)consumption);
        
        // remove leading digits, so that there are maximal 2 digits 
        // before decimal point for .displayValue
        while (strlen(consumption) > 4)
        {
            memmove(consumption, consumption + 1, strlen(consumption));
        }
        returnValueStruct.displayValue = atof((const char *)consumption);
        
