RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
        //#if SERIAL_PRINT == 1
            Serial.printf("\nDisplayValue: %.1f  UnClippedValue: %.1f\n", returnValueStruct.displayValue, returnValueStruct.unClippedValue);
        //#endif                                                                                                                        
      }
      break;                   
      case 1:    // Consumption this day
      {
        // Calculate Day-Consumption from BaseValue and UnClippedValue 
        float copyBaseValue = dataContainer.SampleValues[0].BaseValue;
        float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;
        uint32_t LastSendTimeSeconds = dataContainer._lastSentTime.secondstime();
        uint32_t timeSinceLastSendSeconds = dateTimeUTCNow.secondstime() - LastSendTimeSeconds;
                 
        if (copyBaseValue <= copyUnClippedValue)
        {
          returnValueStruct.displayValue = (copyUnClippedValue - copyBaseValue); 
        }
        else
        {
          // Overflow of copyUnClippedValue has occured
          int preDecimalPoint = (int)copyBaseValue;
          int oneMoreDigit =  pow(10,(int)log10(preDecimalPoint) + 1);
          returnValueStruct.displayValue = copyUnClippedValue + (oneMoreDigit - copyBaseValue);
        }
              
        returnValueStruct.unClippedValue = copyUnClippedValue;
        if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
        {                      
          Serial.printf("\nCase 1: Day-Consumption: %.1f\n", returnValueStruct.displayValue);
        }                      
      }
      break;
      case 2:   // rate
      {
        uint32_t sendIntervalSeconds = dataContainer.SendInterval.totalseconds();
        uint32_t LastSendTimeSeconds = dataContainer._lastSentTime.secondstime();       
        
        float copyLastSendUnClippedValue = dataContainer.SampleValues[0].LastSendUnClippedValue;
        float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;                    
        uint32_t timeSinceLastSendSeconds = dateTimeUTCNow.secondstime() - LastSendTimeSeconds;
             
          // Only print the last messages
          if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
          {
            Serial.printf("LastSendTime: %d Actual: %.d Diff: %d Interval: %d Remain %d\n", LastSendTimeSeconds,  
            dateTimeUTCNow.secondstime(), dateTimeUTCNow.secondstime() - LastSendTimeSeconds, sendIntervalSeconds, 
            LastSendTimeSeconds + sendIntervalSeconds - dateTimeUTCNow.secondstime());
          }
   
        float valueDiffOverflowCorrected = 0;

        if (copyLastSendUnClippedValue <= copyUnClippedValue)
        {
          valueDiffOverflowCorrected = (copyUnClippedValue - copyLastSendUnClippedValue);
          //returnValueStruct.displayValue = (copyUnClippedValue - copyLastSendUnClippedValue); 
        }
        else
        {
          // Overflow of copyUnClippedValue has occured
          int preDecimalPoint = (int)copyLastSendUnClippedValue;
          int oneMoreDigit =  pow(10,(int)log10(preDecimalPoint) + 1);  
          valueDiffOverflowCorrected = copyUnClippedValue + (oneMoreDigit - copyLastSendUnClippedValue);
        }  
        
        float rate = 0.0;

        if (valueDiffOverflowCorrected != 0.0f)
        {
            if (timeSinceLastSendSeconds > 1.0)
            {             
              rate = valueDiffOverflowCorrected * 50.0f / ((float)timeSinceLastSendSeconds / 60.0f); // *50 gives reasonable size in         
            }
        }
          // RoSchmi
          // Only print the last messages
          if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
          {
            Serial.printf("LastSendValue: %.1f Actual: %.1f Diff: %.1f Seconds: %d\n", copyLastSendUnClippedValue, 
            copyUnClippedValue, copyUnClippedValue - copyLastSendUnClippedValue, timeSinceLastSendSeconds);  
          
            Serial.printf("\nCase 2: Flow is: %.1f per minute. Read after: %d seconds\n\n", rate, timeSinceLastSendSeconds);
          }
          // Neglect (set to MAGIC_NUMBER_INVALID when timeSinceLastSendSeconds < 5 sec)
          returnValueStruct.displayValue = timeSinceLastSendSeconds > 5 ? rate : (float)MAGIC_NUMBER_INVALID;
          returnValueStruct.unClippedValue = copyUnClippedValue;                              
      }
      break;
      case 3:
      {

          // in the forth graph show Viessmann Vorlauftemperatur
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //returnValueStruct.displayValue = featureValueSet.SampleValues[1].Value;
          //returnValueStruct.unClippedValue = returnValueStruct.displayValue;
                     
          // This is an alternative way to get a Viessmann Api Sensor valu                      
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //theRead = featureValueSet.SampleValues[1].Value;
          
                      
          //theRead = atoi((char *)sSwiThresholdStr) / 10; // dummy
          //Show ascending lines from 0 to 5, so re-boots of the board are indicated                                                
          //theRead = ((double)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.displayValue = ((float)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.unClippedValue = 0.0;                      
      }                   
      break;
    }
  //}

    return returnValueStruct;
}
  
/*
float ReadAnalogSensor_01(int pSensorIndex)
{
#ifndef USE_SIMULATED_SENSORVALUES
            // Use values read from an analog source
            // Change the function for each sensor to your needs
            // This is an an adaption for a gasmeter
              
              //RoSchmi: Next line was deleted
              //static float unclippedBaseValue_01 = 0.0;
              double theRead = MAGIC_NUMBER_INVALID;           
              if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
              {                              
                switch (pSensorIndex)
                {
                  case 0:
                    { 
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                        
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 4 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : tempNumber * 10;
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }
                      

                      int32_t timeDiffUtcToLocal = localTime.secondstime() - dateTimeUTCNow.secondstime();                   
                      bool isNewDay = dateTimeUTCNow.operator+(timeDiffUtcToLocal).day() != dataContainer._lastSentTime.operator+(timeDiffUtcToLocal).day();
                      
