RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
                      //uint8_t dayUTC = dateTimeUTCNow.day();
                      //uint8_t daylocal = localTime.day();

                      Serial.printf("\n\nTimeDiffInSeconds: %d \n\n", timeDiffUtcToLocal);

                      if (dataContainer._isFirstTransmission || isNewDay)
                      {
                        dataContainer._baseValue = atof((const char *)consumption);                
                      }
                                                                
                      theRead = atof((const char *)consumption) / 100;
                     
                      // As an example we use it here to display an analog value read from the Viessmann Api   
                      
                      // Possible way to get a Viessmann Api Sensor value
                      //ViessmannApiSelection::Feature featureValue = ReadViessmannFeatureFromSelection((const char *)"_92_heating_dhw_outlet_temperature", VI_FEATURES_COUNT);
                      //theRead = atof((char *)featureValue.value);

                      // This is an alternative way to get a Viessmann Api Sensor valu                      
                      
                      //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
                      //theRead = featureValueSet.SampleValues[1].Value;
                      
                     
                      #if SERIAL_PRINT == 1
                        //Serial.printf("\r\nApi-Sensor: %.1f\r\n", theRead);
                      #endif

                      // Take theRead (nearly) 0.0 as invalid
                      // (if no sensor is connected the function returns 0)
                                             
                      //if (theRead > - 0.00001 && theRead < 0.00001)
                      //{
                      //  theRead = MAGIC_NUMBER_INVALID;
                      //}
                                                                                                                          
                    }
                    break;                   
                  case 1:
                    { 
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName: value, raw, pre, error, rate or timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
                      
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                      
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 3 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : (tempNumber *10 );
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }

                      float actValue = atof((const char *)consumption);
                      float baseValue = dataContainer._baseValue;   // _baseValue was stored in case 0:
                          
                      // Get consumption from start of day or since programstart
                      theRead = actValue - baseValue;

                      printf("\nDay  -Consumption: %.1f\n", (float)theRead); 
                         
                    }
                    break;
                  case 2:
                    {
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);                      
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                                         
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 3 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : (tempNumber *10 );
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }

                      float actValue = atof((const char *)consumption);
                      //float baseValue = dataContainer._baseValue;
                      float lastSentValue = dataContainer._SampleValuesSet.SampleValues[0].LastSendUnClippedValue;
                      uint32_t elapsedTime = dateTimeUTCNow.secondstime() - dataContainer._lastSentTime.secondstime();
                      if ((elapsedTime % 5) == 0)  // show only every fifth case
                      {                
                        Serial.printf("ReadAnalogSensor_01 Case 2: ActValue: %.1f LastSentValue: %.1f Elapsed: %d seconds\n", actValue, lastSentValue, elapsedTime);
                      }
                      
                      theRead = (actValue - lastSentValue) * 100 / ((dateTimeUTCNow.secondstime() - dataContainer._lastSentTime.secondstime())/ 60);


                      
                      
