RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
    bufferStorePtr[bufferStoreLength - 1] = '\0';
    Serial.println((char *)bufferStorePtr);
  }
  return responseCode;
}

t_httpCode readUserFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr)
{
  secure_wifi_client.setInsecure();

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &secure_wifi_client, bufferStorePtr);
   #if SERIAL_PRINT == 1
        // Serial.println(myViessmannApiAccount.ClientId);
      #endif
      memset(viessmannApiUser,'\0', viessmannUserBufLen);
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.GetUser(bufferStorePtr, bufferStoreLength);
      Serial.printf("\r\nUser: httpResponseCode is: %d\r\n", responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        uint16_t cntToCopy = strlen((char*)bufferStorePtr) < viessmannUserBufLen ? strlen((char*)bufferStorePtr) : viessmannUserBufLen -1;
        memcpy(viessmannApiUser, bufferStorePtr, cntToCopy);       
      }    
return responseCode;
}

t_httpCode readEquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id)
{
  secure_wifi_client.setInsecure();

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &secure_wifi_client, bufferStorePtr);
   #if SERIAL_PRINT == 1
        //Serial.println(myViessmannApiAccount.ClientId);
      #endif
      
      memset(bufferStorePtr, '\0', bufferStoreLength); 
      t_httpCode responseCode = viessmannClient.GetEquipment(bufferStorePtr, bufferStoreLength);
          
      Serial.printf("\r\nEquipment httpResponseCode is: %d\r\n", responseCode);

      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        const char* json = (char *)bufferStorePtr;
        JsonDocument doc;
        deserializeJson(doc, json);
        
        uint32_t data_0_id = doc["data"][0]["id"];
        const char * data_0_description = doc["data"][0]["description"];
        const char * data_0_address_street = doc["data"][0]["address"]["street"];
        const char * data_0_address_houseNumber = doc["data"][0]["address"]["houseNumber"];
        const char * gateways_0_serial = doc["data"][0]["gateways"][0]["serial"];
        const char * gateways_0_devices_0_id = doc["data"][0]["gateways"][0]["devices"][0]["id"];
        
        *p_data_0_id = data_0_id;
        memset(bufferStorePtr, '\0', bufferStoreLength);
         
        memset(p_data_0_description, '\0', equipBufLen);
        memset(p_data_0_address_street, '\0', equipBufLen);
        memset(p_data_0_address_houseNumber,'\0', equipBufLen);

        memset(p_gateways_0_serial,'\0', equipBufLen);
        memset(p_gateways_0_devices_0_id,'\0', equipBufLen);

        strncpy(p_data_0_description, data_0_description, equipBufLen - 1);
        strncpy(p_data_0_address_street, data_0_address_street, equipBufLen - 1);
        strncpy(p_data_0_address_houseNumber, data_0_address_houseNumber, equipBufLen - 1);

        strncpy(p_gateways_0_serial, gateways_0_serial, equipBufLen - 1);
        strncpy(p_gateways_0_devices_0_id, gateways_0_devices_0_id, equipBufLen - 1);       
      }
  return responseCode; 
}


t_httpCode refreshAccessTokenFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, const char * refreshToken)
{
  secure_wifi_client.setInsecure();

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  const char * accessTokenLabel = "access_token";
  const char * refreshTokenLabel = "refresh_token";
  const char * tokenTypeLabel = "token_type";
  
  
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &secure_wifi_client, bufferStorePtr); 
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.RefreshAccessToken(bufferStorePtr, bufferStoreLength, refreshToken);
      
      Serial.printf("\n(%u) %i/%02d/%02d %02d:%02d ", loadRefreshTokenCount, localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
      Serial.println(F("Refreshing Access Token"));
      Serial.printf("(%u) Refresh Token: httpResponseCode: %d\r\n\r\n", loadRefreshTokenCount++, responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {    
         #if SERIAL_PRINT == 1
          // Serial.printf("%s\n", (char *)bufferStorePtr);
         #endif
         bool tokenIsValid = true;
         char * posAcTok = strnstr((char *)bufferStorePtr, (const char *)"access_token", 50);
         char * posRefrTok = strnstr((char *)bufferStorePtr, (const char *)"refresh_token", 2000);
         char * posTokType = strnstr((char *)bufferStorePtr, (const char *)"token_type", 2000);

         tokenIsValid = posAcTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posRefrTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posTokType == nullptr ? false : tokenIsValid;
         
         tokenIsValid = (tokenIsValid && (posAcTok < posRefrTok) && (posRefrTok < posTokType)) ? true : false;

         if (tokenIsValid)
         {
            char * startAcTok = posAcTok + strlen(accessTokenLabel) + 3;
            char * endAcTok = posRefrTok - 4;
            size_t acTokenLength = (size_t)endAcTok + 1 - (size_t)startAcTok;
            #if SERIAL_PRINT == 1
                Serial.printf("\nTokenlength is: %d\n", acTokenLength);
            #endif
            memcpy(viessmannAccessToken, startAcTok, acTokenLength);
            viessmannAccessToken[acTokenLength] = '\0';
            myViessmannApiAccountPtr ->RenewAccessToken(String(viessmannAccessToken));   
         }
         else
         {
            responseCode = HTTPC_ERROR_SEND_PAYLOAD_FAILED;
            Serial.println(F("Content error. Refreshing Accesstoken failed!\n"));
            bufferStorePtr[bufferStoreLength - 1] = '\0';
            Serial.println((char *)bufferStorePtr);
         }
      }
      else
      {  
        Serial.println(F("Response Error. Refreshing Accesstoken failed!\n"));   
        bufferStorePtr[bufferStoreLength - 1] = '\0';
        Serial.println((char *)bufferStorePtr);
      }
   return responseCode;
      
